#+title: Let's Code

*Let's Code* is a working React Router application we can hack on for fun.

** Just tasks
#+begin_src sh :results output verbatim :exports results
just --list
#+end_src

#+results:
#+begin_example
Available recipes:
    [build]
    build             # Build the app
    docker-build      # Build a container image via Docker
    docker-run *args  # Run a container image via Docker

    [db]
    db-generate *args # Generate migration files from Typescript definitions
    db-migrate *args  # Apply pending migrations
    db-reset          # Remove project PostgreSQL state
    psql              # Start an interactive psql session

    [dev]
    dev               # Start development environment using Docker Compose
    fmt               # Format project source files
    lint              # Lint project source files
    serve             # Run the node server
    setup             # Prepare local development environment
    storybook         # Start Storybook
    storybook-build   # Build Storybook

    [docker]
    docker *args      # Run docker compose commands

    [release]
    check             # Type check source files
    start             # Start the app in production mode

    [test]
    test              # Run project test suite
#+end_example

